HancyWang/PEEP_slaver/STM32F0xx_StdPeriph_Lib_V1.5.0/Projects/STM32F0xx_StdPeriph_Templates/MDK-ARM/LOAD/APP/key_power_on_task.c
#if 0
////PA0,判断USB是插入还是拔出
USB_DETECT_STATE Check_USB_pull_or_push()
{
	while(TRUE)
	{
		//读取PA0的电平
		if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==1)
		{
			Motor_PWM_Freq_Dudy_Set(1,100,0);
			Motor_PWM_Freq_Dudy_Set(2,100,0);
			Motor_PWM_Freq_Dudy_Set(3,100,0);
			Motor_PWM_Freq_Dudy_Set(4,100,0);
			Motor_PWM_Freq_Dudy_Set(5,100,0);
			set_led(LED_ID_MODE1,FALSE);
			set_led(LED_ID_MODE2,FALSE);
			set_led(LED_ID_MODE3,FALSE);
			set_led(LED_ID_GREEN,FALSE);
			//delay_ms(500);  //给500ms的稳定时间
			//set_led(LED_ID_YELLOW,TRUE);  //debug
			
			uint8_t cnt=0;
			//循环5次，如果5次都是高电平，说明已经稳定的插入USB了
			for(uint8_t i=0;i<5;i++)
			{
				delay_ms(5);
				if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==1)
				{
					cnt++;
				}
			}
			
			if(cnt==5) 
			{
				cnt=0;
				//set_led(LED_ID_YELLOW,TRUE);  //debug
				return USB_PUSH_IN;
			}
			else
			{
				return USB_NOT_DETECT;
			}
		}
		else if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==0)
		{
			Motor_PWM_Freq_Dudy_Set(1,100,0);
			Motor_PWM_Freq_Dudy_Set(2,100,0);
			Motor_PWM_Freq_Dudy_Set(3,100,0);
			Motor_PWM_Freq_Dudy_Set(4,100,0);
			Motor_PWM_Freq_Dudy_Set(5,100,0);
			set_led(LED_ID_MODE1,FALSE);
			set_led(LED_ID_MODE2,FALSE);
			set_led(LED_ID_MODE3,FALSE);
			set_led(LED_ID_GREEN,FALSE);
			//delay_ms(500);  //给500ms的稳定时间
			
			uint8_t cnt=0;
			for(uint8_t i=0;i<5;i++)
			{
				delay_ms(5);
				if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==0)
				{
					cnt++;
				}
			}
			
			if(cnt==5) 
			{
				cnt=0;
				return USB_PULL_UP;
			}
			else
			{
				return USB_NOT_DETECT;
			}
		}
		else
		{
			return USB_NOT_DETECT;
		}
	}
}
#endif

 
//void EXTI4_15_IRQHandler()
////void EXTI0_1_IRQHandler(void)
//{
//	if(EXTI_GetITStatus(EXTI_Line0)!=RESET)  
//	{ 
////		b_usb_intterruptHappened=TRUE;
//		if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==1) //高电平表示插入了USB,上拉
//		{
//			//处理USB插入
////			b_usb_push_in=TRUE;
//			usb_detect_state=USB_PUSH_IN;
//		}
//		else if(GPIO_ReadInputDataBit(GPIOA, GPIO_Pin_0)==0)  //低电平表示拔出了USB，下拉
//		{
//			//处理USB拔出
//			//b_usb_pull_up=TRUE;
//			usb_detect_state=USB_PULL_UP;
//		}
//		else
//		{
//			//do nothing
//		}
//		
//		//新增，明天验证一下, //意思是判断了上拉下拉之后就不再进入这个函数，而是去
//		//usb_charge_battery验证USB插拔是否有效
////		b_usb_intterruptHappened=FALSE;
//	}  
//	EXTI_ClearFlag(EXTI_Line0);
//}

void EXTI0_1_IRQHandler(void)
{  
	if(EXTI_GetITStatus(EXTI_Line0)!=RESET)  
	{ 
		key_state=KEY_DOWNING;
//		set_led(LED_ID_YELLOW,TRUE);
//		set_led(LED_ID_GREEN,TRUE);
//		delay_ms(10);
//		set_led(LED_ID_YELLOW,FALSE);
//		set_led(LED_ID_GREEN,FALSE);
	} 
	EXTI_ClearFlag(EXTI_Line0);
	
} 
//void RCC_Configuration_2(void)
//{
//	RCC_DeInit(); 
////RCC_HSICmd(ENABLE);	//???????
//  RCC_PLLConfig(RCC_PLLSource_HSI_Div2, RCC_PLLMul_12);   //??PLL??????PLL????,?????????????,6?? ??24MHz
//  RCC_PLLCmd(ENABLE);                                    //??????PLL
//  while(RCC_GetFlagStatus(RCC_FLAG_PLLRDY)==RESET);      //??PLL???????
//  
//  RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);             //???????,??????????????????:HSI,HSE,RCC_SYSCLKSource_PLLCLK?
// 
//  RCC_HCLKConfig(RCC_SYSCLK_Div1);                       //???AHB????,??PLL?AHB???????????AHB?????PLL?????
//  RCC_PCLKConfig(RCC_HCLK_Div1);                         //??APB????
//  RCC_ADCCLKConfig(RCC_ADCCLK_PCLK_Div4);                //ADC????,?????14MHz
//	 while(RCC_GetSYSCLKSource() != 0x08);                  //???????????, 0x00: HSI used as system clock,0x04: HSE used as system clock ,0x08: PLL used as system clock ?        
//  
//  SystemCoreClockUpdate();               
//}

void init_system_afterWakeUp()
{
	os_ticks = 0;
	//SystemInit();
	RCC_Configuration();
	delay_init();
	os_init();
	init_task();
	
	
//	os_ticks = 0;
//	//os_ticks = 4294967290;
//	delay_init();
//	os_init();
//	SystemInit();
//	init_task();
}


void CfgALLPins4StopMode()
{
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOA | RCC_AHBPeriph_GPIOB, ENABLE);
	
	//led端口PA3,PA4
	GPIO_InitTypeDef GPIO_InitStructure_LED;
	GPIO_InitStructure_LED.GPIO_Pin = LED_GREEN_PWR_PIN|LED_YELLOW_PWR_PIN;                       
	GPIO_InitStructure_LED.GPIO_Speed = GPIO_Speed_50MHz;     
	GPIO_InitStructure_LED.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure_LED.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_LED.GPIO_PuPd=GPIO_PuPd_UP;
	//GPIO_InitStructure_LED.GPIO_PuPd=GPIO_PuPd_NOPULL;
	GPIO_Init(LED_PORT, &GPIO_InitStructure_LED);
	GPIO_SetBits(LED_PORT, LED_GREEN_PWR_PIN|LED_YELLOW_PWR_PIN);

	
	//PA1
	GPIO_InitTypeDef GPIO_InitStructure_PA_1;
	GPIO_InitStructure_PA_1.GPIO_Pin = GPIO_Pin_1;
  GPIO_InitStructure_PA_1.GPIO_Mode = GPIO_Mode_AN;
	//GPIO_InitStructure_PA_1.GPIO_Mode = GPIO_Mode_IN;
  GPIO_InitStructure_PA_1.GPIO_PuPd = GPIO_PuPd_NOPULL ;
  GPIO_Init(GPIOA, &GPIO_InitStructure_PA_1);	
	
	//关闭ADC
	DMA_Cmd(DMA1_Channel1, DISABLE);/* DMA1 Channel1 enable */			
  ADC_DMACmd(ADC1, DISABLE);
	ADC_Cmd(ADC1, DISABLE);  
	
	//PB0不能配置，这个是中断口
//	//PB0
//	GPIO_InitTypeDef GPIO_InitStructure_PB_0;
//	GPIO_InitStructure_PB_0.GPIO_Pin = GPIO_Pin_0;
//  GPIO_InitStructure_PB_0.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PB_0.GPIO_OType=GPIO_OType_PP;
//	//GPIO_InitStructure_PB_0.GPIO_Mode = GPIO_Mode_IN;
//  GPIO_InitStructure_PB_0.GPIO_PuPd = GPIO_PuPd_NOPULL ;
//  GPIO_Init(GPIOB, &GPIO_InitStructure_PB_0);	
//	GPIO_SetBits(GPIOB,GPIO_Pin_0);
	
	//PA8
	GPIO_InitTypeDef GPIO_InitStructure_PA_8;
	GPIO_InitStructure_PA_8.GPIO_Pin = GPIO_Pin_8;                       
	GPIO_InitStructure_PA_8.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PA_8.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure_PA_8.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PA_8.GPIO_PuPd=GPIO_PuPd_UP;
	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_8);	
	GPIO_SetBits(GPIOA,GPIO_Pin_8);  //置为高电平，使蓝牙休眠
	
	
	//串口PA9,PA10
	GPIO_InitTypeDef GPIO_InitStructure_UART;
	GPIO_InitStructure_UART.GPIO_Pin = UART_BLUETOOTH_RX_PIN|UART_BLUETOOTH_TX_PIN;                       
	GPIO_InitStructure_UART.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_UART.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure_UART.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_UART.GPIO_PuPd=GPIO_PuPd_UP;
	GPIO_Init(UART_BLUETOOTH_IO_PORT, &GPIO_InitStructure_UART);
	GPIO_SetBits(UART_BLUETOOTH_IO_PORT,UART_BLUETOOTH_RX_PIN|UART_BLUETOOTH_TX_PIN); 
	//关闭串口
	DMA_Cmd(UART_DMA_RX_CHANNEL, DISABLE);
	DMA_Cmd(UART_DMA_TX_CHANNEL, DISABLE);
	USART_Cmd(UART, DISABLE);
	
