HancyWang/PEEP_slaver/STM32F0xx_StdPeriph_Lib_V1.5.0/Projects/STM32F0xx_StdPeriph_Templates/MDK-ARM/LOAD/APP/key_power_on_task.c
	//PB3,PB4
	GPIO_InitTypeDef GPIO_InitStructure_PB_3_4;
	GPIO_InitStructure_PA_8.GPIO_Pin = GPIO_Pin_3|GPIO_Pin_4;                       
	GPIO_InitStructure_PA_8.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PA_8.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PA_8.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PA_8.GPIO_PuPd=GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_3_4);	
	
	//PB5
	GPIO_InitTypeDef GPIO_InitStructure_PB_5;
	GPIO_InitStructure_PB_5.GPIO_Pin = GPIO_Pin_5;                       
	GPIO_InitStructure_PB_5.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PB_5.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PB_5.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PB_5.GPIO_PuPd=GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_5);
	
	//PB6
	GPIO_InitTypeDef GPIO_InitStructure_PB_6;
	GPIO_InitStructure_PB_6.GPIO_Pin = GPIO_Pin_6;                       
	GPIO_InitStructure_PB_6.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PB_6.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PB_6.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PB_6.GPIO_PuPd=GPIO_PuPd_UP;
	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_6);
//	GPIO_InitStructure_PB_6.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PB_6.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PB_6.GPIO_PuPd=GPIO_PuPd_UP;
//	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_6);
//	GPIO_SetBits(GPIOB,GPIO_Pin_6);

	//PA0,PA2,PA5,PA6,PA7,PA11,PA12,PA15
	GPIO_InitTypeDef GPIO_InitStructure_PA_0_2_5_6_7_11_12_15;
	GPIO_InitStructure_PA_0_2_5_6_7_11_12_15.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_2|GPIO_Pin_5|GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_15;                       
	GPIO_InitStructure_PA_0_2_5_6_7_11_12_15.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PA_0_2_5_6_7_11_12_15.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PA_0_2_5_6_7_11_12_15.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PA_0_2_5_6_7_11_12_15.GPIO_PuPd=GPIO_PuPd_DOWN;
	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_0_2_5_6_7_11_12_15);
	
	//PB1,PB7,PB8,PB9,PB10,PB11,PB12,PB13,PB14,PB15
	GPIO_InitTypeDef GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15;
	GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15.GPIO_Pin = GPIO_Pin_1|GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_10|GPIO_Pin_11|GPIO_Pin_12|GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;                       
	GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15.GPIO_PuPd=GPIO_PuPd_DOWN;
	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_1_7_8_9_10_11_12_13_14_15);
	
	//PC13,14,15
	GPIO_InitTypeDef GPIO_InitStructure_PC_13_14_15;
	GPIO_InitStructure_PC_13_14_15.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;                       
	GPIO_InitStructure_PC_13_14_15.GPIO_Speed = GPIO_Speed_50MHz;       
	GPIO_InitStructure_PC_13_14_15.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PC_13_14_15.GPIO_OType=GPIO_OType_PP;
	GPIO_InitStructure_PC_13_14_15.GPIO_PuPd=GPIO_PuPd_DOWN;
	GPIO_Init(GPIOC, &GPIO_InitStructure_PC_13_14_15);

#if 0	


////	
//	
//	//PWR save，PA12
//	GPIO_InitTypeDef GPIO_InitStructure_PA12;
//	GPIO_InitStructure_PA12.GPIO_Pin = GPIO_Pin_12;                       
//	GPIO_InitStructure_PA12.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PA12.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PA12.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PA12.GPIO_PuPd=GPIO_PuPd_UP;
////	GPIO_InitStructure_PA12.GPIO_PuPd=GPIO_PuPd_NOPULL;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA12);
//	GPIO_SetBits(GPIOA,GPIO_Pin_12);   //输出高电平，关管子，省电

////	GPIO_InitTypeDef GPIO_InitStructure_PA12;
////	GPIO_InitStructure_PA12.GPIO_Pin = GPIO_Pin_12;                       
////	GPIO_InitStructure_PA12.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PA12.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PA12.GPIO_PuPd=GPIO_PuPd_NOPULL;
////	GPIO_Init(GPIOA, &GPIO_InitStructure_PA12);

//	
//	//PWR EN，PA15
//	GPIO_InitTypeDef GPIO_InitStructure_PA15;
//	GPIO_InitStructure_PA15.GPIO_Pin = GPIO_Pin_15;                       
//	GPIO_InitStructure_PA15.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PA15.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PA15.GPIO_OType=GPIO_OType_PP;
//	//GPIO_InitStructure_PA15.GPIO_OType=GPIO_OType_OD;
//	GPIO_InitStructure_PA15.GPIO_PuPd=GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA15);
//	GPIO_ResetBits(GPIOA,GPIO_Pin_15);   //输出低电平，关管子，省电

////	GPIO_InitTypeDef GPIO_InitStructure_PA15;
////	GPIO_InitStructure_PA15.GPIO_Pin = GPIO_Pin_15;                       
////	GPIO_InitStructure_PA15.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PA15.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PA15.GPIO_PuPd=GPIO_PuPd_NOPULL;
////	GPIO_Init(GPIOA, &GPIO_InitStructure_PA15);

//	
//	//PWM1(PA6),PWM2(PA7)  inflate_pwm2(PA11)
//	GPIO_InitTypeDef GPIO_InitStructure_PA_6_7_11;
//	GPIO_InitStructure_PA_6_7_11.GPIO_Pin = GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_11;                       
//	GPIO_InitStructure_PA_6_7_11.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PA_6_7_11.GPIO_Mode = GPIO_Mode_OUT;
//	//GPIO_InitStructure_PA_6_7_11.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PA_6_7_11.GPIO_OType=GPIO_OType_PP;
//	//GPIO_InitStructure_PA_6_7_11.GPIO_PuPd=GPIO_PuPd_NOPULL;
//	GPIO_InitStructure_PA_6_7_11.GPIO_PuPd=GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_6_7_11);
//	GPIO_ResetBits(GPIOA,GPIO_Pin_6|GPIO_Pin_7|GPIO_Pin_11);
//	
//	//PWM3(PB1) BEEP_PWM(PB14)
//	GPIO_InitTypeDef GPIO_InitStructure_PB_1_14;
//	GPIO_InitStructure_PB_1_14.GPIO_Pin = GPIO_Pin_1|GPIO_Pin_14;                       
//	GPIO_InitStructure_PB_1_14.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PB_1_14.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PB_1_14.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PB_1_14.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PB_1_14.GPIO_PuPd=GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_1_14);
//	GPIO_ResetBits(GPIOB,GPIO_Pin_1|GPIO_Pin_14);
//	
////	GPIO_InitTypeDef GPIO_InitStructure_PB_1;
////	GPIO_InitStructure_PB_1.GPIO_Pin = GPIO_Pin_1;                       
////	GPIO_InitStructure_PB_1.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PB_1.GPIO_Mode = GPIO_Mode_OUT;
////	//GPIO_InitStructure_PB_1.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PB_1.GPIO_OType=GPIO_OType_PP;
////	//GPIO_InitStructure_PB_1.GPIO_PuPd=GPIO_PuPd_NOPULL;
////	GPIO_InitStructure_PB_1.GPIO_PuPd=GPIO_PuPd_DOWN;
////	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_1);
////	GPIO_ResetBits(GPIOB,GPIO_Pin_1);

////	GPIO_InitTypeDef GPIO_InitStructure_PB_14;
////	GPIO_InitStructure_PB_14.GPIO_Pin = GPIO_Pin_14;                       
////	GPIO_InitStructure_PB_14.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PB_14.GPIO_Mode = GPIO_Mode_OUT;
////	//GPIO_InitStructure_PB_1.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PB_14.GPIO_OType=GPIO_OType_PP;
////	//GPIO_InitStructure_PB_1.GPIO_PuPd=GPIO_PuPd_NOPULL;
////	GPIO_InitStructure_PB_14.GPIO_PuPd=GPIO_PuPd_DOWN;
////	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_14);
////	GPIO_ResetBits(GPIOB,GPIO_Pin_14);

//	
//	//BAT_CHARGE,BAT_STDBY   PA4,PA5
//	GPIO_InitTypeDef GPIO_InitStructure_PA_4_5;
//	GPIO_InitStructure_PA_4_5.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5;                       
//	GPIO_InitStructure_PA_4_5.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PA_4_5.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PA_4_5.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PA_4_5.GPIO_PuPd=GPIO_PuPd_NOPULL;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_4_5);
//	
////	GPIO_InitTypeDef GPIO_InitStructure_PA_4_5;
////	GPIO_InitStructure_PA_4_5.GPIO_Pin = GPIO_Pin_4|GPIO_Pin_5;                       
////	GPIO_InitStructure_PA_4_5.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PA_4_5.GPIO_Mode = GPIO_Mode_OUT;
////	GPIO_InitStructure_PA_4_5.GPIO_OType=GPIO_OType_PP;
////	GPIO_InitStructure_PA_4_5.GPIO_PuPd=GPIO_PuPd_UP;
////	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_4_5);
////	GPIO_SetBits(GPIOB,GPIO_Pin_4|GPIO_Pin_5);
//	
//	//USB_OE PA0
//	GPIO_InitTypeDef GPIO_InitStructure_PA0;
//	GPIO_InitStructure_PA0.GPIO_Pin = GPIO_Pin_0;                       
//	GPIO_InitStructure_PA0.GPIO_Speed = GPIO_Speed_50MHz;       
//	//GPIO_InitStructure_PA0.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PA0.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PA_4_5.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PA_4_5.GPIO_PuPd=GPIO_PuPd_DOWN;
//	//GPIO_InitStructure_PA_4_5.GPIO_PuPd=GPIO_PuPd_NOPULL;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA0);
//	
//	//VAVLE PB10,PB11
//	GPIO_InitTypeDef GPIO_InitStructure_PB_10_11;
//	GPIO_InitStructure_PB_10_11.GPIO_Pin = GPIO_Pin_10|GPIO_Pin_11;                       
//	GPIO_InitStructure_PB_10_11.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PB_10_11.GPIO_Mode = GPIO_Mode_IN;
////	GPIO_InitStructure_PB_10_11.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PB_10_11.GPIO_PuPd=GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_10_11);
//	
//	//POWER ON/OFF (PA8)
////	GPIO_InitTypeDef GPIO_InitStructure_PA_8;
////	GPIO_InitStructure_PA_8.GPIO_Pin = GPIO_Pin_8;                       
////	GPIO_InitStructure_PA_8.GPIO_Speed = GPIO_Speed_50MHz;       
////	GPIO_InitStructure_PA_8.GPIO_Mode = GPIO_Mode_IN;
////	//GPIO_InitStructure_PA_8.GPIO_OType=GPIO_OType_PP;
////	//GPIO_InitStructure_PA_8.GPIO_PuPd=GPIO_PuPd_DOWN;
////	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_8);
////	//GPIO_SetBits(GPIOA,GPIO_Pin_8);

//	GPIO_InitTypeDef GPIO_InitStructure_PA_8;
//	GPIO_InitStructure_PA_8.GPIO_Pin = GPIO_Pin_8;                       
//	GPIO_InitStructure_PA_8.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PA_8.GPIO_Mode = GPIO_Mode_OUT;
//	GPIO_InitStructure_PA_8.GPIO_OType=GPIO_OType_PP;
//	GPIO_InitStructure_PA_8.GPIO_PuPd=GPIO_PuPd_UP;
//	GPIO_Init(GPIOA, &GPIO_InitStructure_PA_8);
//	GPIO_SetBits(GPIOA,GPIO_Pin_8);

