HancyWang/PEEP_slaver/STM32F0xx_StdPeriph_Lib_V1.5.0/Projects/STM32F0xx_StdPeriph_Templates/MDK-ARM/LOAD/APP/key_power_on_task.c
//	//SWITCH ON/OFF (PB13)   ,SWITCH MODE(PB15)
//	GPIO_InitTypeDef GPIO_InitStructure_PB_13_15;
//	GPIO_InitStructure_PB_13_15.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_15;                       
//	GPIO_InitStructure_PB_13_15.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PB_13_15.GPIO_Mode = GPIO_Mode_IN;
//	//GPIO_InitStructure_PB_13_15.GPIO_OType=GPIO_OType_PP;
//	//GPIO_InitStructure_PB_13_15.GPIO_PuPd=GPIO_PuPd_UP;
//	GPIO_InitStructure_PB_13_15.GPIO_PuPd=GPIO_PuPd_NOPULL;
//	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_13_15);
//	
////		GPIO_InitTypeDef GPIO_InitStructure_PB_15;
////		GPIO_InitStructure_PB_15.GPIO_Pin = GPIO_Pin_15;                       
////		GPIO_InitStructure_PB_15.GPIO_Speed = GPIO_Speed_50MHz;       
////		GPIO_InitStructure_PB_15.GPIO_Mode = GPIO_Mode_OUT;
////		GPIO_InitStructure_PB_15.GPIO_OType=GPIO_OType_PP;
////		GPIO_InitStructure_PB_15.GPIO_PuPd=GPIO_PuPd_UP;
////		GPIO_Init(GPIOB, &GPIO_InitStructure_PB_15);
////		GPIO_SetBits(GPIOB,GPIO_Pin_15);
//	
//	//PB7,PB8,PB9,PB12
//	GPIO_InitTypeDef GPIO_InitStructure_PB_7_8_9_12;
//	GPIO_InitStructure_PB_7_8_9_12.GPIO_Pin = GPIO_Pin_7|GPIO_Pin_8|GPIO_Pin_9|GPIO_Pin_12;                       
//	GPIO_InitStructure_PB_7_8_9_12.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PB_7_8_9_12.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PB_7_8_9_12.GPIO_PuPd = GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOB, &GPIO_InitStructure_PB_7_8_9_12);
//	
//	//PC13,PC14,PC15
//	GPIO_InitTypeDef GPIO_InitStructure_PC_13_14_15;
//	GPIO_InitStructure_PC_13_14_15.GPIO_Pin = GPIO_Pin_13|GPIO_Pin_14|GPIO_Pin_15;                       
//	GPIO_InitStructure_PC_13_14_15.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PC_13_14_15.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PC_13_14_15.GPIO_PuPd = GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOC, &GPIO_InitStructure_PC_13_14_15);
//	
//	//PF0,PF1
//	GPIO_InitTypeDef GPIO_InitStructure_PF_0_1;
//	GPIO_InitStructure_PF_0_1.GPIO_Pin = GPIO_Pin_0|GPIO_Pin_1;                       
//	GPIO_InitStructure_PF_0_1.GPIO_Speed = GPIO_Speed_50MHz;       
//	GPIO_InitStructure_PF_0_1.GPIO_Mode = GPIO_Mode_IN;
//	GPIO_InitStructure_PF_0_1.GPIO_PuPd = GPIO_PuPd_DOWN;
//	GPIO_Init(GPIOF, &GPIO_InitStructure_PF_0_1);
#endif
}

void Init_gloab_viriable()
{
	key_state=KEY_UPING;
	mcu_state=POWER_OFF;
	b_MPXV70_get_zero_point=FALSE;
	MPXV70_zero_point=0;
	MPXV70_state=MPXV70_SAMPLE_DATA;
}

//进入stop模式，采用中断唤醒
void EnterStopMode()
{
	Init_gloab_viriable();
	
	//配置中断
	CfgWFI();
	//I2C芯片ADS115进入power-down模式
	//ADS115_enter_power_down_mode();

	CfgALLPins4StopMode();   
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_PWR, ENABLE);  
	PWR_EnterSTOPMode(PWR_Regulator_LowPower, PWR_STOPEntry_WFI);
}

static uint8_t tmp=0;
void test(void)
{
	if(tmp==50)
	{
		tmp=0;
		set_led(LED_ID_GREEN,TRUE);
		delay_ms(1000);
		set_led(LED_ID_GREEN,FALSE);
	}
	else
	{
		tmp++;
		//set_led(LED_ID_GREEN,FALSE);
	}
	os_delay_ms(TASK_TEST_ID, 20);
}

/*******************************************************************************
** 函数名称: key_power_on_task
** 功能描述: 检查按键是否启动，必须连续按1s以上才能启动系统
** 输　  入: 无
** 输　  出: 无
** 全局变量: 无
** 调用模块: 无
*******************************************************************************/
void key_power_on_task(void)
{
	static uint8_t wakeup_Cnt;
	if(key_state==KEY_DOWNING)
	{
		//set_led(LED_ID_YELLOW,TRUE);
		if(GPIO_ReadInputDataBit(GPIOB, GPIO_Pin_0)==0)
		{
			if(wakeup_Cnt==5)
			{
				wakeup_Cnt=0;	
				b_Is_PCB_PowerOn=!b_Is_PCB_PowerOn;
				
				if(b_Is_PCB_PowerOn)
				{
					mcu_state=POWER_ON;	
					key_state=KEY_WAKE_UP;						
				}
				else
				{
					mcu_state=POWER_OFF;	
					key_state=KEY_STOP_MODE;
				}
			}
			else
			{
				wakeup_Cnt++;
			}
		}
		else
		{
			wakeup_Cnt=0;
			if(!b_Is_PCB_PowerOn)  //b_Is_PCB_PowerOn为FALSE是才进行判断，按键时间过短，不允许启动
			{
				key_state=KEY_FAIL_WAKEUP;
			}
		}
	}
//	
	if(key_state==KEY_FAIL_WAKEUP)
	{
			EnterStopMode();
			init_system_afterWakeUp();
	}
	
	if(key_state==KEY_WAKE_UP)
	{
		//if(b_bat_detected_ok)
		{
			//开机
			set_led(LED_ID_GREEN,TRUE);
//			set_led(LED_ID_YELLOW,TRUE);
//			GPIO_ResetBits(LED_PORT,LED_GREEN_PWR_PIN);
//			GPIO_ResetBits(LED_PORT,LED_YELLOW_PWR_PIN);
//	
			key_state=KEY_UPING;
		}
	}
	
	if(key_state==KEY_STOP_MODE)
	{
		EnterStopMode();
		init_system_afterWakeUp();
	}
	os_delay_10us(KEY_LED_TASK_ID, KEY_LED_PERIOD);  //20ms来一次
//	os_delay_ms(KEY_LED_TASK_ID, KEY_LED_PERIOD);
}

